# 2. เขียนฟังก์ชันเพื่อหาผลรวมของ n รายการแรกของ "1/(1*2)-1/(2*3)+1/(3*4)-1/(4*5)+.. ", ฟังก์ชันใช้ n เป็นพารามิเตอร์ ป้อน n จากแป้นพิมพ์
# คำนวณและส่งออกผลลัพธ์ของการบวกเศษส่วน และเก็บทศนิยมสองตำแหน่งไว้ในผลลัพธ์ ตัวอย่างเช่น การป้อน 10 
# จะให้ผลลัพธ์เป็น 0.38

# "+ 1/(1*2) - 1/(2*3) + 1/(3*4) - 1/(4*5) + .. "

def find_ans(x):
    ans = 0
    for i in range(1,x+1):
        if i % 2 == 0:
            ans -= round(1/(i*i+1),6)
        else:
            ans += round(1/(i*i+1),6)
    return ans

inp = input("Enter N : ")
print(find_ans(int(inp)))